Revit 2027 API
Metal.MetalPatternScale Property
 The property labeled "Scale" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetalPatternScale { get; }
Public Shared ReadOnly Property MetalPatternScale As String
	Get
public:
static property String^ MetalPatternScale {
	String^ get ();
}
static member MetalPatternScale : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" with a minimum of "0".
See Also
Reference
Metal Class
Autodesk.Revit.DB.Visual Namespace